app/controllers/entries_controller.rb

SELECT `entries`.* FROM `entries`
---
  def index
    respond_with Entry.all

INSERT INTO `entries` (`created_at`, `name`, `updated_at`, `username`) VALUES ('2012-12-21 06:13:36', 'Saravanan', '2012-12-21 06:13:36', '172103')
---
  def create
    respond_with Entry.create(params[:entry])